# Taps
tap "homebrew/bundle"
tap "cargo-lambda/cargo-lambda"
tap "d12frosted/emacs-plus"
tap "localstack/tap"
tap "wix/brew"

# CLI Tools
brew "awscli"
brew "cargo-binstall"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
brew "cli53"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "fd"
brew "git"
brew "git-lfs"
brew "go"
brew "colima"
brew "docker"
brew "helm"
brew "hugo"
brew "k3d"
brew "kind"
brew "kubectl"
brew "libtool"
brew "libvterm"
brew "localstack/tap/localstack-cli"
brew "mvfst"
brew "node"
brew "openjdk@17"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "qemu"
brew "ripgrep"
brew "shellcheck"
brew "skaffold"
brew "terraform"
brew "tmux"
brew "watchman"
brew "wget"
brew "wix/brew/applesimutils"
brew "yarn"
brew "gh"

# Applications
cask "bruno"
cask "emacs-plus-app"
cask "google-cloud-sdk"
cask "kegworks"
cask "miniconda"
cask "ngrok"
cask "visual-studio-code"
